AccountingOfGoods/DataProcessors/ЗагрузкаВыпискиБанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗагрузкаВыпискиБанка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>money_Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТаблицаОпераций</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Загружать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаСписания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяДолг</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Кошелек</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КошелькиИСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаПоступления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СсылкаНаОперациюПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТекстСтрокиВыписки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>money_СтатьяЗаполнена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccountingOfGoods/DataProcessors/ЗагрузкаВыпискиБанка/Forms/ЗагрузкаВыписки/Ext/Form/Module.bsl
&НаСервере
Процедура money_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	ТипФайла = "PDF";
	Элементы.ПравилоЧтенияДокумента.Доступность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура money_ТипФайлаПриИзмененииПосле(Элемент)
	
	Если ТипФайла = "PDF" Тогда
		Элементы.ПравилоЧтенияДокумента.Доступность = Ложь;
	Иначе
		Элементы.ПравилоЧтенияДокумента.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПолучитьДиалогВыбораФайла")
Функция money_ПолучитьДиалогВыбораФайла(РежимДиалога, ПутьКФайлу, ИмяФайла)

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);

	ДиалогВыбораФайла.Фильтр       = СтрокаФильтраПоРасширениюФайла(ТекущееРасширение, ДиалогВыбораФайла.ИндексФильтра);

	Если Не ПустаяСтрока(ТекущееРасширение) Тогда
		ДиалогВыбораФайла.Расширение = ТекущееРасширение;
	КонецЕсли;
    #Вставка     
	Если ТипФайла = "PDF" Тогда
		ДиалогВыбораФайла.Расширение = "PDF";
		ДиалогВыбораФайла.Фильтр     = "PDF-файлы (*.pdf)|*.pdf";
	КонецЕсли;
	#КонецВставки
	ДиалогВыбораФайла.Заголовок                   = Заголовок;
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.ПолноеИмяФайла              = ИмяФайла;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = РежимДиалога = РежимДиалогаВыбораФайла.Открытие;

	Возврат ДиалогВыбораФайла;

КонецФункции

&НаКлиенте
&ИзменениеИКонтроль("ПриОкончаниеПомещенияФайла")
Процедура money_ПриОкончаниеПомещенияФайла(Результат, АдресВременногоХранилища, ИмяФайла, Параметр)
    #Вставка
	Если ТипФайла = "PDF" Тогда
		Если Результат = Истина Тогда 
			Если ТекущееРасширение = "pdf" Тогда
				ФоновоеЗадание = Ложь;
				ЗагрузитьФайлСДаннымиВТабличныйДокументНаСервере(АдресВременногоХранилища, ТекущееРасширение, ФоновоеЗадание);
				Если ФоновоеЗадание Тогда

					ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
					ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
					ПараметрыОбработчика.МаксимальныйИнтервал = 5;
					ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ФоновоеЗаданиеИдентификатор);

				Иначе

					ТабличныйДокументВыпискиПриИзмененииКлиент();

				КонецЕсли;

			Иначе

				ПоказатьПредупреждение(,НСтр("ru ='Не получилось загрузить данные из выбранного файла. Убедитесь в корректности его содержимого.'"));

			КонецЕсли;

			ОбновитьКонечныеОбластиНастройкиЧтения(НастройкиЧтения, ТабличныйДокументВыписки);
			ВыделитьОбластиТабличногоДокумента(ЭтотОбъект);
		КонецЕсли;
		Возврат;	
	КонецЕсли;
	#КонецВставки
	Если Результат = Истина Тогда

		Если Найти(СтрокаФильтраПоРасширениюФайла("",0), "*." + ТекущееРасширение) > 0 Тогда

			ФоновоеЗадание = Ложь;
			ЗагрузитьФайлСДаннымиВТабличныйДокументНаСервере(АдресВременногоХранилища, ТекущееРасширение, ФоновоеЗадание);
			Если ФоновоеЗадание Тогда

				ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
				ПодключитьОбработчикОжидания("ФоновоеЗаданиеЗагрузкаФайлаНаКлиенте", 1, Истина);
				ПараметрыОбработчика.МаксимальныйИнтервал = 5;
				ФормаДлительнойОперации = ДлительныеОперацииКлиент.ОткрытьФормуДлительнойОперации(ЭтотОбъект, ФоновоеЗаданиеИдентификатор);

			Иначе

				ТабличныйДокументВыпискиПриИзмененииКлиент();

			КонецЕсли;

		Иначе

			ПоказатьПредупреждение(,НСтр("ru ='Не получилось загрузить данные из выбранного файла. Убедитесь в корректности его содержимого.'"));

		КонецЕсли;

		ОбновитьКонечныеОбластиНастройкиЧтения(НастройкиЧтения, ТабличныйДокументВыписки);
		ВыделитьОбластиТабличногоДокумента(ЭтотОбъект);

	КонецЕсли;

КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ЧтениеТабличногоДокументаОбработатьРезультат")
Процедура money_ЧтениеТабличногоДокументаОбработатьРезультат()

	РезультатЧтения = ПолучитьИзВременногоХранилища(ФоновоеЗаданиеАдресХранилища);

	Объект.ТаблицаОпераций.Очистить();
	Объект.АналитикаОпераций.Очистить();

	Для каждого СтрокаРезультата Из РезультатЧтения Цикл

		// Добавляем строку операции
		НоваяСтрока = Объект.ТаблицаОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата, , "Аналитика");

		// Обновляем представление объектов и операции

		// Обновляем иконки объектов в строке
		Если Не ЗначениеЗаполнено(НоваяСтрока.Кошелек) Тогда
			НоваяСтрока.КошелекИконка = БиблиотекаКартинок.БыстроСоздатьЭлементСписка;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(НоваяСтрока.СтатьяДолг) И Не ЗначениеЗаполнено(НоваяСтрока.СсылкаНаОперацию) Тогда
			НоваяСтрока.СтатьяДолгИконка = БиблиотекаКартинок.БыстроСоздатьЭлементСписка;
		КонецЕсли;

		Если ЗначениеЗаполнено(НоваяСтрока.СсылкаНаОперацию) Тогда
			НоваяСтрока.НоваяОперация = 0;
			ОбновитьКошелекИСтатьиПоСсылкеНаОперацию(Объект.ТаблицаОпераций, НоваяСтрока.ПолучитьИдентификатор(), ПредставленияВидовОпераций, Ложь);
		Иначе
			НоваяСтрока.НоваяОперация = 1;
			НоваяСтрока.СсылкаНаОперациюИконка = БиблиотекаКартинок.БыстроСоздатьЭлементСписка;
		КонецЕсли;
        #Вставка     
		Если ЗначениеЗаполнено(НоваяСтрока.СтатьяДолг) Тогда
			НоваяСтрока.money_СтатьяЗаполнена = 1;
		Иначе
			НоваяСтрока.money_СтатьяЗаполнена = 0;
		КонецЕсли;		
		#КонецВставки
		// заполняем строки аналитики
		НоваяСтрока.Аналитика.Загрузить(СтрокаРезультата.Аналитика); 

	КонецЦикла;

	ФильтрТаблицыОпераций = "Все";
	ПриИзмененииФильтраТаблицыОпераций(Истина);

КонецПроцедуры

&НаКлиенте
Процедура money_ТаблицаОперацийСтатьяДолгПриИзмененииПосле(Элемент)
	
	ДанныеСтроки = Элементы.ТаблицаОпераций.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ДанныеСтроки.СтатьяДолг) Тогда
		ДанныеСтроки.money_СтатьяЗаполнена = 1;	
	Иначе
		ДанныеСтроки.money_СтатьяЗаполнена = 0;	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
&ИзменениеИКонтроль("ПриИзмененииФильтраТаблицыОпераций")
Процедура money_ПриИзмененииФильтраТаблицыОпераций(ИзменятьОтбор)

	КоличествоВсего        = Объект.ТаблицаОпераций.Количество();
	КоличествоНовых        = Объект.ТаблицаОпераций.Итог("НоваяОперация");

	ЗаголовокВсеОперации = НСтр("ru='Все операции (%1)'");
	ЗаголовокВсеОперации = СтрШаблон(ЗаголовокВсеОперации, КоличествоВсего);
	ЗаголовокНовые = НСтр("ru='Новые (%1)'");
	ЗаголовокНовые = СтрШаблон(ЗаголовокНовые, КоличествоНовых);
	ЗаголовокЗагруженные = НСтр("ru='Загруженные (%1)'");
	ЗаголовокЗагруженные = СтрШаблон(ЗаголовокЗагруженные, КоличествоВсего - КоличествоНовых);

	Элементы.ФильтрТаблицыОпераций.СписокВыбора[0].Представление = ЗаголовокВсеОперации;
	Элементы.ФильтрТаблицыОпераций.СписокВыбора[1].Представление = ЗаголовокНовые;
	Элементы.ФильтрТаблицыОпераций.СписокВыбора[2].Представление = ЗаголовокЗагруженные;
	#Вставка                        
	КоличествоСоСтатьей    = Объект.ТаблицаОпераций.Итог("money_СтатьяЗаполнена");
	ЗаголовокБезСтатьи = НСтр("ru='Без статьи (%1)'");
	ЗаголовокБезСтатьи = СтрШаблон(ЗаголовокБезСтатьи, КоличествоВсего - КоличествоСоСтатьей);	
	Элементы.ФильтрТаблицыОпераций.СписокВыбора[3].Представление = ЗаголовокБезСтатьи;
	#КонецВставки

	Если ИзменятьОтбор Тогда

		Если ФильтрТаблицыОпераций = "Новые" Тогда
			Элементы.ТаблицаОпераций.ОтборСтрок = Новый ФиксированнаяСтруктура("НоваяОперация", 1);
		ИначеЕсли ФильтрТаблицыОпераций = "Загруженные" Тогда
			Элементы.ТаблицаОпераций.ОтборСтрок = Новый ФиксированнаяСтруктура("НоваяОперация", 0);
		#Вставка     
		ИначеЕсли ФильтрТаблицыОпераций = "НеЗаполненаСтатья" Тогда
			Элементы.ТаблицаОпераций.ОтборСтрок = Новый ФиксированнаяСтруктура("money_СтатьяЗаполнена", 0);
		#КонецВставки
		Иначе
			Элементы.ТаблицаОпераций.ОтборСтрок = Неопределено;
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
